; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared0 - mode
	image1 - mode
	thermograph3 - mode
	image2 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	GroundStation7 - direction
	Star0 - direction
	GroundStation6 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 image2)
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(have_image Phenomenon8 image1)
	(have_image Star9 image1)
	(have_image Star10 thermograph3)
	(have_image Star11 infrared0)
	(have_image Star12 infrared0)
	(have_image Star13 infrared0)
))

)

; plan
1. (turn_to satellite0 groundstation6 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 star11 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star11)
   goals met: 0 of 7
5. (take_image satellite0 star11 instrument0 infrared0)
   added: (have_image star11 infrared0)
   goals met: 1 of 7
6. (turn_to satellite0 star10 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star10)
   goals met: 1 of 7
7. (take_image satellite0 star10 instrument0 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon8 instrument0 image1)
   added: (have_image phenomenon8 image1)
   goals met: 3 of 7
10. (turn_to satellite0 star12 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star12)
   goals met: 3 of 7
11. (take_image satellite0 star12 instrument0 infrared0)
   added: (have_image star12 infrared0)
   goals met: 4 of 7
12. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 4 of 7
13. (take_image satellite0 star13 instrument0 infrared0)
   added: (have_image star13 infrared0)
   goals met: 5 of 7
14. (turn_to satellite0 star9 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star9)
   goals met: 5 of 7
15. (take_image satellite0 star9 instrument0 image1)
   added: (have_image star9 image1)
   goals met: 6 of 7
16. (turn_to satellite0 groundstation1 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation1)
   goals met: 7 of 7
